// pages/sort/sort.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      xueyuan:["物联网工程学院",'食品学院','设计学院','生物工程学院','商学院','理学院','纺织服装学院','机械学院',
      '马克思主义学院','医学院','人文学院','法学院','北美学院','化学与材料工程学院','环境与土木工程学院','药学院',
      '外国语学院','数字媒体学院'],
      nianji:['大一','大二','大三','大四','研一','研二','研三'],
      major:[['计算机科学与技术','物联网工程','通信工程','自动化','','',''],[],[],[],[],[],[],[],[],[],[],[],[],[],[],[]],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})